Week 9/W9D5/Music_App/app/views/tracks/new.html.erb

        <select  name="track[album_id]">
            <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"