Week 9/W9D5/MusicRapp/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---

  <% @band.albums.each do |album| %>