Week 9/W9D5/Music_App/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
<br><br>
<% @band.albums.each do |album| %>