Week 9/W9D5/MusicRapp/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Bilmem ne"], ["year", 2019], ["created_at", "2019-12-14 04:24:41.479344"], ["updated_at", "2019-12-14 04:24:41.479344"], ["band_id", 1]]
---
    def create
        @album = Album.new(album_params)
        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        @album = Album.find(params[:id])