Week 9/W9D5/MusicRapp/app/controllers/bands_controller.rb

    def create
        @band = Band.new(band_params)
        @band.user_id = current_user.id
        if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kudrat"], ["created_at", "2020-02-02 05:21:15.182007"], ["updated_at", "2020-02-02 05:21:15.182007"], ["user_id", 5]]

    def update
        @band = Band.find(params[:id])
        if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Duman_edited"], ["updated_at", "2019-12-14 20:34:56.616689"], ["id", 1]]