Week 9/W9D5/MusicRapp/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @album = Album.find(params[:album_id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tracks" ("title", "ord", "created_at", "updated_at", "album_id", "lyrics") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @track = Track.new(track_params)
        @album = Album.find(params[:album_id])
        @track.album_id = @album.id
        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "tiiirrreeeeek bosstan\r\ntiiireeek bostannnnnnn\r\n"], ["updated_at", "2019-12-14 20:44:57.066957"], ["id", 3]]
---
    def update
        @track = Track.find(params[:id])
        if @track.update(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]
---
    def destroy
        @track = Track.find(params[:id])
        @track.destroy