Week 9/W9D5/Music_App/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]
---

<% @album.tracks.each do |track| %>