Week 9/W9D5/Music_App/app/controllers/albums_controller.rb

    def create
        @album = Album.new(album_params)
        @album.live = "true"
        if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Darmaduman"], ["year", 2013], ["band_id", 1], ["created_at", "2020-01-27 23:57:49.956289"], ["updated_at", "2020-01-27 23:57:49.956289"]]

    def update
        @album = Album.find(params[:id])
        if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "third album"], ["updated_at", "2020-01-28 00:49:10.613862"], ["id", 3]]

    def destroy
        album = Album.find(params[:id])
        album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]