Week 9/W9D5/Music_App/app/controllers/bands_controller.rb

    def create
        @band = Band.new(band_params)
        @band.user_id = current_user.id
        if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Duman"], ["created_at", "2020-01-27 23:38:56.553143"], ["updated_at", "2020-01-27 23:38:56.553143"], ["user_id", 2]]