Week 9/W9D5/Music_App/app/controllers/tracks_controller.rb

    def new
        @album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @track = Track.new(track_params)
        @album = Album.find(@track.album_id)
        @track.album_id = @album.id
        if @track.save
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"