Week 9/W9D5/MusicRapp/app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
---
  <select id='track-album' name="track[album_id]">
    <% Album.all.each do |album| %>